Masmiseim36/nxpSDK/devices/MIMXRT1173/mcuxpresso/startup_mimxrt1173_cm4.cpp
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    0,                                 // Reserved
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MIMXRT1173_cm4
    DMA0_DMA16_IRQHandler,               // 16 : DMA channel 0/16 transfer complete
    DMA1_DMA17_IRQHandler,               // 17 : DMA channel 1/17 transfer complete
    DMA2_DMA18_IRQHandler,               // 18 : DMA channel 2/18 transfer complete
    DMA3_DMA19_IRQHandler,               // 19 : DMA channel 3/19 transfer complete
    DMA4_DMA20_IRQHandler,               // 20 : DMA channel 4/20 transfer complete
    DMA5_DMA21_IRQHandler,               // 21 : DMA channel 5/21 transfer complete
    DMA6_DMA22_IRQHandler,               // 22 : DMA channel 6/22 transfer complete
    DMA7_DMA23_IRQHandler,               // 23 : DMA channel 7/23 transfer complete
    DMA8_DMA24_IRQHandler,               // 24 : DMA channel 8/24 transfer complete
    DMA9_DMA25_IRQHandler,               // 25 : DMA channel 9/25 transfer complete
    DMA10_DMA26_IRQHandler,              // 26 : DMA channel 10/26 transfer complete
    DMA11_DMA27_IRQHandler,              // 27 : DMA channel 11/27 transfer complete
    DMA12_DMA28_IRQHandler,              // 28 : DMA channel 12/28 transfer complete
    DMA13_DMA29_IRQHandler,              // 29 : DMA channel 13/29 transfer complete
    DMA14_DMA30_IRQHandler,              // 30 : DMA channel 14/30 transfer complete
    DMA15_DMA31_IRQHandler,              // 31 : DMA channel 15/31 transfer complete
    DMA_ERROR_IRQHandler,                // 32 : DMA error interrupt channels 0-15 / 16-31
    Reserved33_IRQHandler,               // 33 : Reserved interrupt
    Reserved34_IRQHandler,               // 34 : Reserved interrupt
    CORE_IRQHandler,                     // 35 : CorePlatform exception IRQ
    LPUART1_IRQHandler,                  // 36 : LPUART1 TX interrupt and RX interrupt
    LPUART2_IRQHandler,                  // 37 : LPUART2 TX interrupt and RX interrupt
    LPUART3_IRQHandler,                  // 38 : LPUART3 TX interrupt and RX interrupt
    LPUART4_IRQHandler,                  // 39 : LPUART4 TX interrupt and RX interrupt
    LPUART5_IRQHandler,                  // 40 : LPUART5 TX interrupt and RX interrupt
    LPUART6_IRQHandler,                  // 41 : LPUART6 TX interrupt and RX interrupt
    LPUART7_IRQHandler,                  // 42 : LPUART7 TX interrupt and RX interrupt
    LPUART8_IRQHandler,                  // 43 : LPUART8 TX interrupt and RX interrupt
    LPUART9_IRQHandler,                  // 44 : LPUART9 TX interrupt and RX interrupt
    LPUART10_IRQHandler,                 // 45 : LPUART10 TX interrupt and RX interrupt
    LPUART11_IRQHandler,                 // 46 : LPUART11 TX interrupt and RX interrupt
    LPUART12_IRQHandler,                 // 47 : LPUART12 TX interrupt and RX interrupt
    LPI2C1_IRQHandler,                   // 48 : LPI2C1 interrupt
    LPI2C2_IRQHandler,                   // 49 : LPI2C2 interrupt
    LPI2C3_IRQHandler,                   // 50 : LPI2C3 interrupt
    LPI2C4_IRQHandler,                   // 51 : LPI2C4 interrupt
    LPI2C5_IRQHandler,                   // 52 : LPI2C5 interrupt
    LPI2C6_IRQHandler,                   // 53 : LPI2C6 interrupt
    LPSPI1_IRQHandler,                   // 54 : LPSPI1 interrupt request line to the core
    LPSPI2_IRQHandler,                   // 55 : LPSPI2 interrupt request line to the core
    LPSPI3_IRQHandler,                   // 56 : LPSPI3 interrupt request line to the core
    LPSPI4_IRQHandler,                   // 57 : LPSPI4 interrupt request line to the core
    LPSPI5_IRQHandler,                   // 58 : LPSPI5 interrupt request line to the core
    LPSPI6_IRQHandler,                   // 59 : LPSPI6 interrupt request line to the core
    CAN1_IRQHandler,                     // 60 : CAN1 interrupt
    CAN1_ERROR_IRQHandler,               // 61 : CAN1 error interrupt
    CAN2_IRQHandler,                     // 62 : CAN2 interrupt
    CAN2_ERROR_IRQHandler,               // 63 : CAN2 error interrupt
    CAN3_IRQHandler,                     // 64 : CAN3 interrupt
    CAN3_ERROR_IRQHandler,               // 65 : CAN3 erro interrupt
    Reserved66_IRQHandler,               // 66 : Reserved interrupt
    KPP_IRQHandler,                      // 67 : Keypad nterrupt
    Reserved68_IRQHandler,               // 68 : Reserved interrupt
    GPR_IRQ_IRQHandler,                  // 69 : GPR interrupt
    eLCDIF_IRQHandler,                   // 70 : eLCDIF interrupt
    LCDIFv2_IRQHandler,                  // 71 : LCDIFv2 interrupt
    CSI_IRQHandler,                      // 72 : CSI interrupt
    PXP_IRQHandler,                      // 73 : PXP interrupt
    MIPI_CSI_IRQHandler,                 // 74 : MIPI_CSI interrupt
    MIPI_DSI_IRQHandler,                 // 75 : MIPI_DSI interrupt
    GPU2D_IRQHandler,                    // 76 : GPU2D interrupt
    GPIO12_Combined_0_15_IRQHandler,     // 77 : Combined interrupt indication for GPIO12 signal 0 throughout 15
    GPIO12_Combined_16_31_IRQHandler,    // 78 : Combined interrupt indication for GPIO13 signal 16 throughout 31
    DAC_IRQHandler,                      // 79 : DAC interrupt
    KEY_MANAGER_IRQHandler,              // 80 : PUF interrupt
    WDOG2_IRQHandler,                    // 81 : WDOG2 interrupt
    SNVS_HP_NON_TZ_IRQHandler,           // 82 : SRTC Consolidated Interrupt. Non TZ
    SNVS_HP_TZ_IRQHandler,               // 83 : SRTC Security Interrupt. TZ
    SNVS_PULSE_EVENT_IRQHandler,         // 84 : ON-OFF button press shorter than 5 secs (pulse event)
    CAAM_IRQ0_IRQHandler,                // 85 : CAAM interrupt queue for JQ0
    CAAM_IRQ1_IRQHandler,                // 86 : CAAM interrupt queue for JQ1
    CAAM_IRQ2_IRQHandler,                // 87 : CAAM interrupt queue for JQ2
    CAAM_IRQ3_IRQHandler,                // 88 : CAAM interrupt queue for JQ3
    CAAM_RECORVE_ERRPR_IRQHandler,       // 89 : CAAM interrupt for recoverable error
    CAAM_RTIC_IRQHandler,                // 90 : CAAM interrupt for RTIC
    CDOG_IRQHandler,                     // 91 : CDOG interrupt
    SAI1_IRQHandler,                     // 92 : SAI1 interrupt
    SAI2_IRQHandler,                     // 93 : SAI1 interrupt
    SAI3_RX_IRQHandler,                  // 94 : SAI3 interrupt
    SAI3_TX_IRQHandler,                  // 95 : SAI3 interrupt
    SAI4_RX_IRQHandler,                  // 96 : SAI4 interrupt
    SAI4_TX_IRQHandler,                  // 97 : SAI4 interrupt
    SPDIF_IRQHandler,                    // 98 : SPDIF interrupt
    TMPSNS_INT_IRQHandler,               // 99 : TMPSNS interrupt
    TMPSNS_LOW_HIGH_IRQHandler,          // 100: TMPSNS low high interrupt
    TMPSNS_PANIC_IRQHandler,             // 101: TMPSNS panic interrupt
    LPSR_LP8_BROWNOUT_IRQHandler,        // 102: LPSR 1p8 brownout interrupt
    LPSR_LP0_BROWNOUT_IRQHandler,        // 103: LPSR 1p0 brownout interrupt
    ADC1_IRQHandler,                     // 104: ADC1 interrupt
    ADC2_IRQHandler,                     // 105: ADC2 interrupt
    USBPHY1_IRQHandler,                  // 106: USBPHY1 interrupt
    USBPHY2_IRQHandler,                  // 107: USBPHY2 interrupt
    RDC_IRQHandler,                      // 108: RDC interrupt
    GPIO13_Combined_0_31_IRQHandler,     // 109: Combined interrupt indication for GPIO13 signal 0 throughout 31
    Reserved110_IRQHandler,              // 110: Reserved interrupt
    DCIC1_IRQHandler,                    // 111: DCIC1 interrupt
    DCIC2_IRQHandler,                    // 112: DCIC2 interrupt
    ASRC_IRQHandler,                     // 113: ASRC interrupt
    FLEXRAM_ECC_IRQHandler,              // 114: FlexRAM ECC fatal interrupt
    GPIO7_8_9_10_11_IRQHandler,          // 115: GPIO7, GPIO8, GPIO9, GPIO10, GPIO11 interrupt
    GPIO1_Combined_0_15_IRQHandler,      // 116: Combined interrupt indication for GPIO1 signal 0 throughout 15
    GPIO1_Combined_16_31_IRQHandler,     // 117: Combined interrupt indication for GPIO1 signal 16 throughout 31
    GPIO2_Combined_0_15_IRQHandler,      // 118: Combined interrupt indication for GPIO2 signal 0 throughout 15
    GPIO2_Combined_16_31_IRQHandler,     // 119: Combined interrupt indication for GPIO2 signal 16 throughout 31
    GPIO3_Combined_0_15_IRQHandler,      // 120: Combined interrupt indication for GPIO3 signal 0 throughout 15
    GPIO3_Combined_16_31_IRQHandler,     // 121: Combined interrupt indication for GPIO3 signal 16 throughout 31
    GPIO4_Combined_0_15_IRQHandler,      // 122: Combined interrupt indication for GPIO4 signal 0 throughout 15
    GPIO4_Combined_16_31_IRQHandler,     // 123: Combined interrupt indication for GPIO4 signal 16 throughout 31
    GPIO5_Combined_0_15_IRQHandler,      // 124: Combined interrupt indication for GPIO5 signal 0 throughout 15
    GPIO5_Combined_16_31_IRQHandler,     // 125: Combined interrupt indication for GPIO5 signal 16 throughout 31
    FLEXIO1_IRQHandler,                  // 126: FLEXIO1 interrupt
    FLEXIO2_IRQHandler,                  // 127: FLEXIO2 interrupt
    WDOG1_IRQHandler,                    // 128: WDOG1 interrupt
    RTWDOG4_IRQHandler,                  // 129: RTWDOG4 interrupt
    EWM_IRQHandler,                      // 130: EWM interrupt
    OCOTP_READ_FUSE_ERROR_IRQHandler,    // 131: OCOTP read fuse error interrupt
    OCOTP_READ_DONE_ERROR_IRQHandler,    // 132: OCOTP read fuse done interrupt
    GPC_IRQHandler,                      // 133: GPC interrupt
    MUB_IRQHandler,                      // 134: MUB interrupt
    GPT1_IRQHandler,                     // 135: GPT1 interrupt
    GPT2_IRQHandler,                     // 136: GPT2 interrupt
    GPT3_IRQHandler,                     // 137: GPT3 interrupt
    GPT4_IRQHandler,                     // 138: GPT4 interrupt
    GPT5_IRQHandler,                     // 139: GPT5 interrupt
    GPT6_IRQHandler,                     // 140: GPT6 interrupt
    PWM1_0_IRQHandler,                   // 141: PWM1 capture 0, compare 0, or reload 0 interrupt
    PWM1_1_IRQHandler,                   // 142: PWM1 capture 1, compare 1, or reload 0 interrupt
    PWM1_2_IRQHandler,                   // 143: PWM1 capture 2, compare 2, or reload 0 interrupt
    PWM1_3_IRQHandler,                   // 144: PWM1 capture 3, compare 3, or reload 0 interrupt
    PWM1_FAULT_IRQHandler,               // 145: PWM1 fault or reload error interrupt
    FLEXSPI1_IRQHandler,                 // 146: FlexSPI1 interrupt
    FLEXSPI2_IRQHandler,                 // 147: FlexSPI2 interrupt
    SEMC_IRQHandler,                     // 148: SEMC interrupt
    USDHC1_IRQHandler,                   // 149: USDHC1 interrupt
    USDHC2_IRQHandler,                   // 150: USDHC2 interrupt
    USB_OTG2_IRQHandler,                 // 151: USBO2 USB OTG2
    USB_OTG1_IRQHandler,                 // 152: USBO2 USB OTG1
    ENET_IRQHandler,                     // 153: ENET interrupt
    ENET_1588_Timer_IRQHandler,          // 154: ENET_1588_Timer interrupt
    ENET_1G_MAC0_Tx_Rx_1_IRQHandler,     // 155: ENET 1G MAC0 transmit/receive 1
    ENET_1G_MAC0_Tx_Rx_2_IRQHandler,     // 156: ENET 1G MAC0 transmit/receive 2
    ENET_1G_IRQHandler,                  // 157: ENET 1G interrupt
    ENET_1G_1588_Timer_IRQHandler,       // 158: ENET_1G_1588_Timer interrupt
    XBAR1_IRQ_0_1_IRQHandler,            // 159: XBAR1 interrupt
    XBAR1_IRQ_2_3_IRQHandler,            // 160: XBAR1 interrupt
    ADC_ETC_IRQ0_IRQHandler,             // 161: ADCETC IRQ0 interrupt
    ADC_ETC_IRQ1_IRQHandler,             // 162: ADCETC IRQ1 interrupt
    ADC_ETC_IRQ2_IRQHandler,             // 163: ADCETC IRQ2 interrupt
    ADC_ETC_IRQ3_IRQHandler,             // 164: ADCETC IRQ3 interrupt
    ADC_ETC_ERROR_IRQ_IRQHandler,        // 165: ADCETC Error IRQ interrupt
    Reserved166_IRQHandler,              // 166: Reserved interrupt
    Reserved167_IRQHandler,              // 167: Reserved interrupt
    Reserved168_IRQHandler,              // 168: Reserved interrupt
    Reserved169_IRQHandler,              // 169: Reserved interrupt
    Reserved170_IRQHandler,              // 170: Reserved interrupt
    PIT1_IRQHandler,                     // 171: PIT1 interrupt
    PIT2_IRQHandler,                     // 172: PIT2 interrupt
    ACMP1_IRQHandler,                    // 173: ACMP interrupt
    ACMP2_IRQHandler,                    // 174: ACMP interrupt
    ACMP3_IRQHandler,                    // 175: ACMP interrupt
    ACMP4_IRQHandler,                    // 176: ACMP interrupt
    Reserved177_IRQHandler,              // 177: Reserved interrupt
    Reserved178_IRQHandler,              // 178: Reserved interrupt
    Reserved179_IRQHandler,              // 179: Reserved interrupt
    Reserved180_IRQHandler,              // 180: Reserved interrupt
    ENC1_IRQHandler,                     // 181: ENC1 interrupt
    ENC2_IRQHandler,                     // 182: ENC2 interrupt
    ENC3_IRQHandler,                     // 183: ENC3 interrupt
    ENC4_IRQHandler,                     // 184: ENC4 interrupt
    Reserved185_IRQHandler,              // 185: Reserved interrupt
    Reserved186_IRQHandler,              // 186: Reserved interrupt
    TMR1_IRQHandler,                     // 187: TMR1 interrupt
    TMR2_IRQHandler,                     // 188: TMR2 interrupt
    TMR3_IRQHandler,                     // 189: TMR3 interrupt
    TMR4_IRQHandler,                     // 190: TMR4 interrupt
    SEMA4_CP0_IRQHandler,                // 191: SEMA4 CP0 interrupt
    SEMA4_CP1_IRQHandler,                // 192: SEMA4 CP1 interrupt
    PWM2_0_IRQHandler,                   // 193: PWM2 capture 0, compare 0, or reload 0 interrupt
    PWM2_1_IRQHandler,                   // 194: PWM2 capture 1, compare 1, or reload 0 interrupt
    PWM2_2_IRQHandler,                   // 195: PWM2 capture 2, compare 2, or reload 0 interrupt
    PWM2_3_IRQHandler,                   // 196: PWM2 capture 3, compare 3, or reload 0 interrupt
    PWM2_FAULT_IRQHandler,               // 197: PWM2 fault or reload error interrupt
    PWM3_0_IRQHandler,                   // 198: PWM3 capture 0, compare 0, or reload 0 interrupt
    PWM3_1_IRQHandler,                   // 199: PWM3 capture 1, compare 1, or reload 0 interrupt
    PWM3_2_IRQHandler,                   // 200: PWM3 capture 2, compare 2, or reload 0 interrupt
    PWM3_3_IRQHandler,                   // 201: PWM3 capture 3, compare 3, or reload 0 interrupt
    PWM3_FAULT_IRQHandler,               // 202: PWM3 fault or reload error interrupt
    PWM4_0_IRQHandler,                   // 203: PWM4 capture 0, compare 0, or reload 0 interrupt
    PWM4_1_IRQHandler,                   // 204: PWM4 capture 1, compare 1, or reload 0 interrupt
    PWM4_2_IRQHandler,                   // 205: PWM4 capture 2, compare 2, or reload 0 interrupt
    PWM4_3_IRQHandler,                   // 206: PWM4 capture 3, compare 3, or reload 0 interrupt
    PWM4_FAULT_IRQHandler,               // 207: PWM4 fault or reload error interrupt
    Reserved208_IRQHandler,              // 208: Reserved interrupt
    Reserved209_IRQHandler,              // 209: Reserved interrupt
    Reserved210_IRQHandler,              // 210: Reserved interrupt
    Reserved211_IRQHandler,              // 211: Reserved interrupt
    Reserved212_IRQHandler,              // 212: Reserved interrupt
    Reserved213_IRQHandler,              // 213: Reserved interrupt
    Reserved214_IRQHandler,              // 214: Reserved interrupt
    Reserved215_IRQHandler,              // 215: Reserved interrupt
    HWVAD_EVENT_IRQHandler,              // 216: HWVAD event interrupt
    HWVAD_ERROR_IRQHandler,              // 217: HWVAD error interrupt
    PDM_EVENT_IRQHandler,                // 218: PDM event interrupt
    PDM_ERROR_IRQHandler,                // 219: PDM error interrupt
    EMVSIM1_IRQHandler,                  // 220: EMVSIM1 interrupt
    EMVSIM2_IRQHandler,                  // 221: EMVSIM2 interrupt
    MECC1_INT_IRQHandler,                // 222: MECC1 int
    MECC1_FATAL_INT_IRQHandler,          // 223: MECC1 fatal int
    MECC2_INT_IRQHandler,                // 224: MECC2 int
    MECC2_FATAL_INT_IRQHandler,          // 225: MECC2 fatal int
    XECC_FLEXSPI1_INT_IRQHandler,        // 226: XECC int
    XECC_FLEXSPI1_FATAL_INT_IRQHandler,  // 227: XECC fatal int
    XECC_FLEXSPI2_INT_IRQHandler,        // 228: XECC int
    XECC_FLEXSPI2_FATAL_INT_IRQHandler,  // 229: XECC fatal int
    XECC_SEMC_INT_IRQHandler,            // 230: XECC int
    XECC_SEMC_FATAL_INT_IRQHandler,      // 231: XECC fatal int
    ENET_QOS_IRQHandler,                 // 232: ENET_QOS interrupt
    ENET_QOS_PMT_IRQHandler,             // 233: ENET_QOS_PMT interrupt


}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {


    // Disable interrupts
    __asm volatile ("cpsid i");

    __asm volatile ("MSR MSP, %0" : : "r" (&_vStackTop) : );



#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    volatile unsigned int *WDOG1_WCR = (unsigned int *) 0x400B8000;
    *WDOG1_WCR = *WDOG1_WCR & ~(1 << 2);
    volatile unsigned int *WDOG2_WCR = (unsigned int *) 0x400D0000;
    *WDOG2_WCR = *WDOG2_WCR & ~(1 << 2);
    // Write watchdog update key to unlock
    *((volatile unsigned int *)0x40038004) = 0xD928C520;
    // Set timeout value
    *((volatile unsigned int *)0x40038008) = 0xFFFF;
    // Now disable watchdog via control register
    volatile unsigned int *RTWDOG_CS = (unsigned int *) 0x40038000;
    *RTWDOG_CS = (*RTWDOG_CS & ~(1 << 7)) | (1 << 5);

#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

